DataProcessors/ПанельОбменЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПанельОбменЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОчередьПередачиДанныхЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПередачиДанныхЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕГАИСПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВскрытыеПотребительскиеУпаковкиИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВскрытыеПотребительскиеУпаковкиИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Склад</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОборудованиеРозливаИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВскрытыхПотребительскихУпаковокИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодключениеКегаКОборудованиюРозливаИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключения</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемСлива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ШтрихкодУпаковкиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОбменаЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресУТМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортУТМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьВходящиеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеРасписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРесурсОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРесурсСклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФСРАР</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РабочиеМестаИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИзмерениеОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИзмерениеСклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПанельОбменЕГАИС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УпрощеннаяИнтеграцияБЭД                    = ИнтеграцияИС.УпрощеннаяИнтеграцияБЭД();
	ЕстьПравоСоздаватьНастройкиПодключенияКУТМ = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.НастройкиОбменаЕГАИС);
	
	НастроитьВидимость();

	ВосстановитьНастройкиФормы();
	ОбновитьСпискиДокументов();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТребуетсяНастроитьПодключениеКУТМ И ЕстьПравоСоздаватьНастройкиПодключенияКУТМ Тогда
		ПодключитьОбработчикОжидания("ОткрытьФормуСозданияПодключенияЕГАИС", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КлассификаторОрганизацийЕГАИС" Тогда
		ОтобразитьСостояниеОбмена();
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьСостояниеОбменаНажатие(Элемент)
	
	Если ЕстьТолькоСообщенияОжидающиеОтправки Тогда
		
		ПараметрыОткрытияФормы = Неопределено;
		Если ОрганизацииЕГАИС.Количество() > 0 Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОрганизацияЕГАИС", ОрганизацииЕГАИС.ВыгрузитьЗначения());
			
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
			
		КонецЕсли;
		
		ОткрытьФорму(
			"РегистрСведений.ОчередьПередачиДанныхЕГАИС.ФормаСписка",
			ПараметрыОткрытияФормы);
		
	ИначеЕсли ТребуетсяНастроитьПодключениеКУТМ Тогда
		Если ЕстьПравоСоздаватьНастройкиПодключенияКУТМ Тогда
			ОткрытьФормуСозданияПодключенияЕГАИС();
		Иначе
			ПоказатьПредупреждение( , НСтр("ru = 'Для настройки подключения к УТМ обратитесь к администратору.'"));
		КонецЕсли;
		
	Иначе
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Организации", ОрганизацииЕГАИС);
		
		ОткрытьФорму(
			"Обработка.ПанельОбменЕГАИС.Форма.СостоянияОбмена",
			ПараметрыОткрытияФормы, ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#Область ОтборПоОрганизацииЕГАИС

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСПриИзменении(Элемент)
	
	Элементы.ОткрытьWebИнтерфейсУТМ.Видимость = ЗначениеЗаполнено(ОрганизацииЕГАИС);
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ОрганизацииЕГАИС, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОткрытьФормуВыбораОрганизацийЕГАИС(
		ЭтотОбъект, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы(),
		Новый ОписаниеОповещения("ПослеВыбораОрганизацииЕГАИС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, Неопределено, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборОрганизацияЕГАИСПриИзменении(Элемент)
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ОрганизацияЕГАИС, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОткрытьФормуВыбораОрганизацийЕГАИС(
		ЭтотОбъект,
		"Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы(),
		Новый ОписаниеОповещения("ПослеВыбораОрганизацииЕГАИС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, Неопределено, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаЕГАИС(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияЕГАИС.Форма.НастройкиЕГАИС", , ЭтотОбъект);
	
КонецПроцедуры

#Область ТТНВходщиеЕГАИС

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ТТНИсходящаяЕГАИС

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ТранспортнаяНакладнаяЕГАИС

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область АктПостановкиНаБалансЕГАИС

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область АктСписанияЕГАИС

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаВРегистр2ЕГАИС

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратИзРегистра2ЕГАИС

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЧекЕГАИС

&НаКлиенте
Процедура ОткрытьЧекЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЧекЕГАИСВозврат

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозврат(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВскрытыеПотребительскиеУпаковкиИС

&НаКлиенте
Процедура ОткрытьВскрытыеПотребительскиеУпаковкиИС(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиЕГАИС

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросыАкцизныхМарокЕГАИС

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыЕГАИС

&НаКлиенте
Процедура ОткрытьОтчетЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область УведомленияОНачалеОборотаЕГАИС

&НаКлиенте
Процедура ОткрытьУведомлениеОНачалеОборотаЕГАИС(Команда)
	
	ОчиститьСообщения();
	
	Если ОрганизацииЕГАИС.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнено поле ""Организация ЕГАИС""'"),,
			"ОрганизацияЕГАИС");
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() = 1 Тогда
		
		ВыполнитьОткрытьWebИнтерфейсФРАПУТМ(ОрганизацияЕГАИС);
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() > 1 Тогда
		
		ОрганизацииЕГАИС.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения(
				"ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаФРАПУТМ", ЭтотОбъект),
				НСтр("ru = 'Выбор организации ЕГАИС'"),
				ОрганизацииЕГАИС.Получить(0));
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетОПроизводствеЕГАИС

&НаКлиенте
	Процедура ОткрытьОтчетОПроизводствеЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПроизводствеЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПроизводствеЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПроизводствеЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область УведомленияОПланируемомИмпортеЕГАИС

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыОбИмпортеЕГАИС

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьПомощникКорректировкиОстатков(Команда)
	
	ПараметрыОткрытия = Новый Структура("Организация", ОрганизацияЕГАИС);
	ОткрытьФорму("Обработка.ПомощникКорректировкиОстатковЕГАИС.Форма.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьПротоколОбменаЕГАИС(Команда)
//
//	ОткрытьФорму("Справочник.ЕГАИСПрисоединенныеФайлы.Форма.ФормаСписка");
//
//КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ОбменДаннымиЕГАИСКлиент.ВыполнитьОбмен(
		ИнтеграцияЕГАИСКлиент.ОрганизацииЕГАИСДляОбмена(
			ЭтотОбъект),,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьWebИнтерфейсУТМ(Команда)
	
	ОчиститьСообщения();
	
	Если ОрганизацииЕГАИС.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнено поле ""Организация ЕГАИС""'"),,
			"ОрганизацияЕГАИС");
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() = 1 Тогда
		
		ВыполнитьОткрытьWebИнтерфейсУТМ(ОрганизацияЕГАИС);
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() > 1 Тогда
		
		ОрганизацииЕГАИС.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения(
				"ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаУТМ", ЭтотОбъект),
				НСтр("ru = 'Выбор организации ЕГАИС'"),
				ОрганизацииЕГАИС.Получить(0));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАкцизныеМаркиНаОстаткахОрганизации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция", ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации"));
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
		ПараметрыФормы,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРежимаОтладки(Команда)
	
	ОткрытьФорму("Обработка.ПанельОбменЕГАИС.Форма.НастройкиРежимаОтладки");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда) Экспорт
	
	СобытияФормИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимость()
	
	Элементы.ГруппаПомощникКорректировкиОстатков.Видимость    = ПравоДоступа("Использование", Метаданные.Обработки.ПомощникКорректировкиОстатковЕГАИС);
	
	Элементы.ГруппаПроизводствоИмпорт.Видимость               = ИнтеграцияЕГАИСИСМП.ДоступнаРаботаСКодамиМаркировкиИСМП();
	Элементы.ОткрытьУведомлениеОНачалеОборотаЕГАИС.Видимость  = ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП");
	
	Элементы.НастройкаЕГАИС.Видимость                          = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаСмТакже.Видимость                           = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаВскрытыеПотребительскиеУпаковкиИС.Видимость = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаЗапросАкцизныхМарокЕГАИС.Видимость          = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаПередачаВРегистр2ЕГАИС.Видимость            = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаВозвратИзРегистра2ЕГАИС.Видимость           = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.Ответственный.Видимость                           = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.СтраницыОтборОрганизацияЕГАИС.Видимость           = Не УпрощеннаяИнтеграцияБЭД;
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.НастройкаЕГАИС.Заголовок = НСтр("ru='Настройки и справочники'");
	Иначе
		Элементы.НастройкаЕГАИС.Заголовок = НСтр("ru='Справочники'");
	КонецЕсли;
	
	ОбменДаннымиЕГАИС.УстановитьВидимостьКомандыВыполнитьОбмен(ЭтотОбъект, "ФормаВыполнитьОбмен");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресИПортУТМ(ОрганизацияЕГАИС)
	
	ВозвращаемоеЗначение = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиОбменаЕГАИС.АдресУТМ КАК АдресУТМ,
	|	НастройкиОбменаЕГАИС.ПортУТМ КАК ПортУТМ
	|ИЗ
	|	РегистрСведений.НастройкиОбменаЕГАИС КАК НастройкиОбменаЕГАИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|		ПО НастройкиОбменаЕГАИС.ИдентификаторФСРАР = КлассификаторОрганизацийЕГАИС.Код
	|		И КлассификаторОрганизацийЕГАИС.Ссылка = &ОрганизацияЕГАИС
	|ГДЕ
	|	НастройкиОбменаЕГАИС.РабочееМесто = &РабочееМесто
	|	ИЛИ НастройкиОбменаЕГАИС.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("РабочееМесто",     МенеджерОборудованияВызовСервера.РабочееМестоКлиента());
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("АдресУТМ", Выборка.АдресУТМ);
		ВозвращаемоеЗначение.Вставить("ПортУТМ",  Выборка.ПортУТМ);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменСЕГАИС", "ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменСЕГАИС", "Ответственный",    Ответственный);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	ОрганизацииЕГАИС = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменСЕГАИС", "ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	Ответственный    = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменСЕГАИС", "Ответственный",    Ответственный);
	
	ИнтеграцияЕГАИС.ОтборПоОрганизацииПриСозданииНаСервере(ЭтотОбъект, "Отбор");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДокумент(Таблица, МетаданныеОбъекта, Заголовок, Оформите = Истина, Отработайте = Истина, Ожидайте = Истина)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Метаданные  = МетаданныеОбъекта;
	НоваяСтрока.Заголовок   = Заголовок;
	НоваяСтрока.Оформите    = Оформите;
	НоваяСтрока.Отработайте = Отработайте;
	НоваяСтрока.Ожидайте    = Ожидайте;
	
	Если МетаданныеОбъекта = Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС Тогда
		НоваяСтрока.ЕстьПравоЧтение         = ПравоДоступа("Чтение", МетаданныеОбъекта);
		НоваяСтрока.ЕстьПравоРедактирование = ПравоДоступа("Редактирование", МетаданныеОбъекта);
	Иначе
		НоваяСтрока.ЕстьПравоЧтение         = ПравоДоступа("Чтение", МетаданныеОбъекта);
		НоваяСтрока.ЕстьПравоРедактирование = ПравоДоступа("Редактирование", МетаданныеОбъекта);
		НоваяСтрока.ЕстьПравоДобавление     = ПравоДоступа("Добавление", МетаданныеОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументов()
	
	ОбновитьСпискиДокументовЕГАИС();
	ОтобразитьСостояниеОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументовЕГАИС()
	
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Метаданные");
	ТаблицаДокументы.Колонки.Добавить("Заголовок");
	ТаблицаДокументы.Колонки.Добавить("Оформите");
	ТаблицаДокументы.Колонки.Добавить("Отработайте");
	ТаблицаДокументы.Колонки.Добавить("Ожидайте");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоЧтение");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоДобавление");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоРедактирование");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНВходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные (входящие)'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНИсходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные (исходящие)'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС,
		НСтр("ru = 'Транспортные накладные'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктПостановкиНаБалансЕГАИС,
		НСтр("ru = 'Акты постановки на баланс'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктСписанияЕГАИС,
		НСтр("ru = 'Акты списания'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОстаткиЕГАИС,
		НСтр("ru = 'Остатки'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетЕГАИС,
		НСтр("ru = 'Отчеты'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС,
		НСтр("ru = 'Запросы акцизных марок'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИС,
		НСтр("ru = 'Чеки ЕГАИС'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИСВозврат,
		НСтр("ru = 'Чеки ЕГАИС на возврат'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.УведомлениеОПланируемомИмпортеЕГАИС,
		НСтр("ru = 'Уведомления о планируемом импорте'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетОбИмпортеЕГАИС,
		НСтр("ru = 'Отчеты об импорте'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетОПроизводствеЕГАИС,
		НСтр("ru = 'Отчеты о производстве'"));
	
	Если Не УпрощеннаяИнтеграцияБЭД Тогда
		
		ДобавитьДокумент(
			ТаблицаДокументы,
			Метаданные.Документы.ПередачаВРегистр2ЕГАИС,
			НСтр("ru = 'Передачи в регистр №2'"));
		
		ДобавитьДокумент(
			ТаблицаДокументы,
			Метаданные.Документы.ВозвратИзРегистра2ЕГАИС,
			НСтр("ru = 'Возвраты из регистра №2'"),
			Ложь);
		
		ДобавитьДокумент(
			ТаблицаДокументы,
			Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС,
			СокрЛП(СтрЗаменить(ОбщегоНазначенияИСПовтИсп.ПредставленияВскрытыхПотребительскихУпаковок("ЕГАИС").ЗаголовокСписка, "ЕГАИС", "")),
			Ложь,    // Оформите
			Ложь,  // Отработайте
			Ложь); // Ожидайте
		
	КонецЕсли;
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ВсеТребующиеОжидания = Новый Массив;
	ВсеТребующиеДействия = Новый Массив;
	
	Для Каждого ТекЭлемент Из ТаблицаДокументы Цикл
		
		Если Не ТекЭлемент.ЕстьПравоЧтение Тогда
			Элементы["Группа" + ТекЭлемент.Метаданные.Имя].Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлемент.Метаданные = Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТекЭлемент.Метаданные.ПолноеИмя());
		
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеОжидания() Цикл
			Если ВсеТребующиеОжидания.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеОжидания.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеДействия() Цикл
			Если ВсеТребующиеДействия.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеДействия.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		
		Если ТекЭлемент.Оформите И ТекЭлемент.ЕстьПравоДобавление Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОформите(),
				ТекЭлемент.Метаданные.Имя + "Оформите");
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте И ТекЭлемент.ЕстьПравоРедактирование Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОтработайте(),
				ТекЭлемент.Метаданные.Имя + "Отработайте");
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОжидайте(),
				ТекЭлемент.Метаданные.Имя + "Ожидайте");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ОрганизацияЕГАИС",            ОрганизацииЕГАИС);
	ПараметрыЗапроса.Вставить("БезОтбораПоОрганизацииЕГАИС", ОрганизацииЕГАИС.Количество() = 0);
	ПараметрыЗапроса.Вставить("Ответственный",        ?(ЗначениеЗаполнено(Ответственный), Ответственный,    Неопределено));
	ПараметрыЗапроса.Вставить("ВсеТребующиеОжидания", ВсеТребующиеОжидания);
	ПараметрыЗапроса.Вставить("ВсеТребующиеДействия", ВсеТребующиеДействия);
	
	Запрос = Новый Запрос;
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
	
	Для ТекИндекс = 0 По ТаблицаДокументы.Количество() - 1 Цикл
		
		ТекЭлемент = ТаблицаДокументы[ТекИндекс];
		ИмяДокумента = ТекЭлемент.Метаданные.Имя;
		
		Если НЕ ТекЭлемент.ЕстьПравоЧтение Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлемент.Оформите Тогда
			КнопкаОформите = Элементы["Открыть" + ИмяДокумента + "Оформите"];
			ПустаяОформите = Элементы["Открыть" + ИмяДокумента + "ОформитеДекорация"];
			ТекстОформите  = НСтр("ru = 'оформите'");
			
			Если ТекЭлемент.ЕстьПравоДобавление Тогда
				
				Выборка = РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать();
				
				Если ТекЭлемент.Метаданные = Метаданные.Документы.ПередачаВРегистр2ЕГАИС Тогда
					
					СобытияФормИС.ВывестиПоказатель(
						Выборка, КнопкаОформите, ТекстОформите, Истина, Ложь);
					
				ИначеЕсли ТекЭлемент.Метаданные = Метаданные.Документы.АктПостановкиНаБалансЕГАИС Тогда
					
					КоличествоДокументов = ?(Выборка.Следующий(), Выборка.КоличествоДокументов, 0);
					
					Если Цел(КоличествоДокументов) > 0 Тогда
						СобытияФормИС.ВывестиПоказатель(Цел(КоличествоДокументов), КнопкаОформите, ТекстОформите, Истина);
					ИначеЕсли КоличествоДокументов > 0 Тогда
						СобытияФормИС.ВывестиПоказатель(1, КнопкаОформите, ТекстОформите, Истина, Ложь);
					Иначе
						СобытияФормИС.ВывестиПоказатель(0, КнопкаОформите, ТекстОформите, Истина);
					КонецЕсли;
				
				Иначе
					
					СобытияФормИС.ВывестиПоказатель(
						Выборка, КнопкаОформите, ТекстОформите, Истина);
					
				КонецЕсли;
				
				ПустаяОформите.Видимость = Ложь;
			Иначе
				КнопкаОформите.Видимость = Ложь;
				ПустаяОформите.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте Тогда
			КнопкаОтработайте = Элементы["Открыть" + ИмяДокумента + "Отработайте"];
			ПустаяОтработайте = Элементы["Открыть" + ИмяДокумента + "ОтработайтеДекорация"];
			ТекстОтработайте  = НСтр("ru = 'отработайте'");
			
			Если ТекЭлемент.ЕстьПравоРедактирование Тогда
				 СобытияФормИС.ВывестиПоказатель(
					РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Отработайте"].Выбрать(), КнопкаОтработайте, ТекстОтработайте, Истина);
				
				ПустаяОтработайте.Видимость = Ложь;
			Иначе
				КнопкаОтработайте.Видимость = Ложь;
				ПустаяОтработайте.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			КнопкаОжидайте = Элементы["Открыть" + ИмяДокумента + "Ожидайте"];
			ТекстОжидайте  = НСтр("ru = 'ожидайте'");
			
			СобытияФормИС.ВывестиПоказатель(
				РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Ожидайте"].Выбрать(), КнопкаОжидайте, ТекстОжидайте, Истина);
		КонецЕсли;
		
		СобытияФормИС.ВывестиПоказатель(
			0,
			Элементы["Открыть" + ИмяДокумента],
			ТекЭлемент.Заголовок,
			Истина,
			Ложь);
		
	КонецЦикла;
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеОбмена()
	
	РезультатыЗапроса = ИнтеграцияЕГАИС.СостояниеОбмена(ОрганизацииЕГАИС);
	
	ПерваяПроблема = Неопределено;
	ЕщеПроблемы    = 0;
	
	ЕстьТолькоСообщенияОжидающиеОтправки = Ложь;
	ТребуетсяНастроитьПодключениеКУТМ    = Ложь;
	
	//@skip-check bsl-legacy-check-string-literal
	НастройкиПодключения = РезультатыЗапроса["НастройкиОбменаЕГАИС"].Выбрать();
	Если НастройкиПодключения.Количество() = 0 Тогда
		ПерваяПроблема = НСтр("ru='Настройте подключение к УТМ'");
		Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный;
		ТекстЗаголовка = ПерваяПроблема;

		Элементы.НадписьСостояниеОбмена.Заголовок = ТекстЗаголовка;
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Истина;
		Элементы.НадписьСостояниеОбмена.Видимость         = Истина;
		
		ТребуетсяНастроитьПодключениеКУТМ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()
		И Не ОбщегоНазначения.РазделениеВключено()
		И Не ИнтеграцияИС.ХранитьФайлыВТомахНаДиске() Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			ПерваяПроблема = НСтр("ru='Рекомендуется настроить хранение файлов в томах на диске'");
			Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
		КонецЕсли;
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	Проблемы = РезультатыЗапроса["ЕстьСообщенияОжидающиеОтправки"].Выбрать();
	Если Проблемы.Количество() > 0 Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			Проблемы.Следующий();
			ПерваяПроблема = СтрШаблон(
				НСтр("ru = 'Есть сообщения (%1), ожидающие отправки в ЕГАИС. Выполните обмен.'"),
				Проблемы.КоличествоСообщений);
			Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаИнформация;
			ЕстьТолькоСообщенияОжидающиеОтправки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Метаданные",    "ОбработкаОтветовЕГАИС");
		Отбор.Вставить("Использование", Истина);
		
		УстановитьПривилегированныйРежим(Истина);
		ЗаданиеВключено = РегламентныеЗаданияСервер.НайтиЗадания(Отбор).Количество() > 0;
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Не ЗаданиеВключено Тогда
			Если ПерваяПроблема <> Неопределено Тогда
				ЕщеПроблемы = ЕщеПроблемы + 1;
			Иначе
				ПерваяПроблема = НСтр("ru='Рекомендуется настроить автоматический обмен с ЕГАИС'");
				Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначенияИС.СерииИспользуются() Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Метаданные",    "СверткаРегистраСоответствиеНоменклатурыЕГАИС");
			Отбор.Вставить("Использование", Истина);
			
			УстановитьПривилегированныйРежим(Истина);
			ЗаданиеВключено = РегламентныеЗаданияСервер.НайтиЗадания(Отбор).Количество() > 0;
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Не ЗаданиеВключено Тогда
				Если ПерваяПроблема <> Неопределено Тогда
					ЕщеПроблемы = ЕщеПроблемы + 1;
				Иначе
					ПерваяПроблема = НСтр("ru='Рекомендуется настроить свертку регистра соответствия номенклатуры ЕГАИС'");
					Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПроблемыКлассификаторов = ИнтеграцияЕГАИС.ПроблемыКлассификаторовВПанелиОбмена();
	Если ЗначениеЗаполнено(ПроблемыКлассификаторов.ДоступноОбновлениеОписание) Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			ПерваяПроблема = ПроблемыКлассификаторов.ДоступноОбновлениеОписание;
			Если ПроблемыКлассификаторов.ЭтоКритичнаяПроблема Тогда
				Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный;
			Иначе
				Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПерваяПроблема <> Неопределено Тогда
		
		Если ЕщеПроблемы > 0 Тогда
			ТекстЗаголовка = СтрШаблон(НСтр("ru='%1 ( + еще %2 )'"), ПерваяПроблема, ЕщеПроблемы);
			ЕстьТолькоСообщенияОжидающиеОтправки = Ложь;
		Иначе
			ТекстЗаголовка = ПерваяПроблема;
		КонецЕсли;
		
		Элементы.НадписьСостояниеОбмена.Заголовок = ТекстЗаголовка;
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Истина;
		Элементы.НадписьСостояниеОбмена.Видимость         = Истина;

	Иначе
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Ложь;
		Элементы.НадписьСостояниеОбмена.Видимость         = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаДокументов(ИмяФормы,
	                                   ДальнейшееДействиеЕГАИС,
	                                   ОткрытьРаспоряжения = Ложь,
	                                   ИмяПоляОтветственный = Неопределено,
	                                   ИмяПоляОрганизация = Неопределено)
	
	СтруктураБыстрогоОтбора = Новый Структура();
	ПараметрыФормы = Новый Структура;
	
	Если ОткрытьРаспоряжения Тогда
		ПараметрыФормы.Вставить("ОткрытьРаспоряжения", Истина);
	ИначеЕсли ДальнейшееДействиеЕГАИС <> Неопределено Тогда
		СтруктураБыстрогоОтбора.Вставить("ДальнейшееДействиеЕГАИС", ДальнейшееДействиеЕГАИС);
	КонецЕсли;
	
	Если ИмяПоляОтветственный = Неопределено Тогда
		ИмяПоляОтветственный = "Ответственный";
	КонецЕсли;
	
	Если ИмяПоляОрганизация = Неопределено Тогда
		ИмяПоляОрганизация = "ОрганизацияЕГАИС";
	КонецЕсли;
	
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОтветственный, Ответственный);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизация,   ОрганизацииЕГАИС);
	
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если ИмяФормы = "РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС" Тогда
		ПараметрыОткрытия = ОбщегоНазначенияИСКлиент.ПараметрыОткрытияФормыСпискаПотребительскихУпаковок();
		ПараметрыОткрытия.ПараметрыФормы = ПараметрыФормы;
		ОбщегоНазначенияЕГАИСКлиент.ОткрытьФормуСпискаВскрытыхПотребительскихУпаковок(ПараметрыОткрытия);
	Иначе
		ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОрганизацииЕГАИС(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОткрытьWebИнтерфейсУТМ(ВыбраннаяОрганизацияЕГАИС)
	
	ПараметрыУТМ = АдресИПортУТМ(ВыбраннаяОрганизацияЕГАИС);
	Если ПараметрыУТМ <> Неопределено Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			"http://" + ПараметрыУТМ.АдресУТМ + ":" + Формат(ПараметрыУТМ.ПортУТМ, "ЧГ=0") + "/");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Не заданы параметры подключения к УТМ для организации ЕГАИС %1'"), ВыбраннаяОрганизацияЕГАИС),,
			"ОрганизацияЕГАИС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОткрытьWebИнтерфейсФРАПУТМ(ВыбраннаяОрганизацияЕГАИС)
	
	ПараметрыУТМ = АдресИПортУТМ(ВыбраннаяОрганизацияЕГАИС);
	Если ПараметрыУТМ <> Неопределено Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			"http://" + ПараметрыУТМ.АдресУТМ + ":" + Формат(ПараметрыУТМ.ПортУТМ, "ЧГ=0")
				 + "/app/services/notification-beginning-turnover");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Не заданы параметры подключения к УТМ для организации ЕГАИС %1'"), ВыбраннаяОрганизацияЕГАИС),,
			"ОрганизацияЕГАИС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаУТМ(ВыбраннаяОрганизацияЕГАИС, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяОрганизацияЕГАИС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОткрытьWebИнтерфейсУТМ(ВыбраннаяОрганизацияЕГАИС.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаФРАПУТМ(ВыбраннаяОрганизацияЕГАИС, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяОрганизацияЕГАИС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОткрытьWebИнтерфейсФРАПУТМ(ВыбраннаяОрганизацияЕГАИС.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданияПодключенияЕГАИС()
	
	ПараметрыОткрытияФормы = Неопределено;
	ОткрытьФорму(
		"РегистрСведений.НастройкиОбменаЕГАИС.Форма.ФормаЗаписи",
		ПараметрыОткрытияФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
